# -*- coding: utf-8 -*-
# ---
# jupyter:
#   jupytext:
#     formats: ipynb,jl:hydrogen
#     text_representation:
#       extension: .jl
#       format_name: hydrogen
#       format_version: '1.3'
#       jupytext_version: 1.10.3
#   kernelspec:
#     display_name: Julia 1.11.2
#     language: julia
#     name: julia-1.11
# ---

# %% [markdown]
# https://x.com/hotty_m57/status/1868812383634026549
#
# <img src="IMG_7530.jpeg">

# %% [markdown]
# __解答例:__ 問題の行列を$A$と書く.
# $A$の列は9種類しかない.
# それら9本の列を並べてできる$15\times 9$行列を$B$と書く.
# $A$のrankは$A$の列達ではられるベクトル空間の次元に等しいので,
# $A$と$B$のrankは等しい.
# $B$の第1列を他のすべての列から引き, さらに第1列以外の列を$-1$倍して得られる行列を$C$と書く. 
# $A,B,C$のrankは等しい.
# $C$は$B$の第1列以外の成分の$1,0$をそれぞれ$0,1$に置き換えたものに等しい.
#
# $$
# B = \begin{bmatrix}
# 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 \\
# 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 & 0 \\
# 1 & 1 & 1 & 1 & 1 & 1 & 1 & 0 & 0 \\
# 1 & 1 & 1 & 1 & 1 & 1 & 0 & 0 & 0 \\
# 1 & 1 & 1 & 0 & 0 & 0 & 0 & 0 & 0 \\
# 1 & 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
# 1 & 0 & 0 & 1 & 1 & 1 & 1 & 0 & 0 \\
# 1 & 0 & 0 & 1 & 1 & 1 & 1 & 0 & 0 \\
# 1 & 0 & 0 & 1 & 1 & 1 & 1 & 0 & 0 \\
# 1 & 0 & 1 & 1 & 1 & 1 & 0 & 0 & 1 \\
# 1 & 1 & 1 & 1 & 1 & 0 & 0 & 1 & 1 \\
# 1 & 1 & 1 & 1 & 1 & 0 & 1 & 1 & 1 \\
# 1 & 1 & 1 & 1 & 0 & 1 & 1 & 1 & 1 \\
# 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 \\
# 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 & 1 \\
# \end{bmatrix}
# \longrightarrow
# C = \begin{bmatrix}
# 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
# 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 \\
# 1 & 0 & 0 & 0 & 0 & 0 & 0 & 1 & 1 \\
# 1 & 0 & 0 & 0 & 0 & 0 & 1 & 1 & 1 \\
# 1 & 0 & 0 & 1 & 1 & 1 & 1 & 1 & 1 \\
# 1 & 0 & 1 & 1 & 1 & 1 & 1 & 1 & 1 \\
# 1 & 1 & 1 & 0 & 0 & 0 & 0 & 1 & 1 \\
# 1 & 1 & 1 & 0 & 0 & 0 & 0 & 1 & 1 \\
# 1 & 1 & 1 & 0 & 0 & 0 & 0 & 1 & 1 \\
# 1 & 1 & 0 & 0 & 0 & 0 & 1 & 1 & 0 \\
# 1 & 0 & 0 & 0 & 0 & 1 & 1 & 0 & 0 \\
# 1 & 0 & 0 & 0 & 0 & 1 & 0 & 0 & 0 \\
# 1 & 0 & 0 & 0 & 1 & 0 & 0 & 0 & 0 \\
# 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
# 1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
# \end{bmatrix}
# $$

# %% [markdown]
# 第$i$成分が$x_i$の$9$次元列ベクトル$x$に関する方程式$Cx=0$は以下と同値になる:
#
# \begin{align*}
# & (1) \quad x_{1} = 0 \\
# & (2) \quad x_{1}+x_{9} = 0 \\
# & (3) \quad x_{1}+x_{8}+x_{9} = 0 \\
# & (4) \quad x_{1}+x_{7}+x_{8}+x_{9} = 0 \\
# & (5) \quad x_{1}+x_{4}+x_{5}+x_{6}+x_{7}+x_{8}+x_{9} = 0 \\
# & (6) \quad x_{1}+x_{3}+x_{4}+x_{5}+x_{6}+x_{7}+x_{8}+x_{9} = 0 \\
# & (7) \quad x_{1}+x_{2}+x_{3}+x_{8}+x_{9} = 0 \\
# & (8) \quad x_{1}+x_{2}+x_{3}+x_{8}+x_{9} = 0 \\
# & (9) \quad x_{1}+x_{2}+x_{3}+x_{8}+x_{9} = 0 \\
# & (10) \quad x_{1}+x_{2}+x_{7}+x_{8} = 0 \\
# & (11) \quad x_{1}+x_{6}+x_{7} = 0 \\
# & (12) \quad x_{1}+x_{6} = 0 \\
# & (13) \quad x_{1}+x_{5} = 0 \\
# & (14) \quad x_{1} = 0 \\
# & (15) \quad x_{1} = 0 \\
# \end{align*}

# %% [markdown]
# (1),(2),(3),(4),(13),(12),(10),(9),(5)より, 順次 $x_1,x_9,x_8,x_7,x_5,x_6,x_2,x_3,x_4$がゼロだと分かる.
# ゆえに($A$のrank)=($C$のrank)は$9$に等しい.

# %%
ENV["COLUMNS"] = 200
using LinearAlgebra

A =[
    1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1
    1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1
    1 1 1 1 1 0 0 1 1 1 1 1 1 0 0 0 1 1 1 1 1 1 0 0 1 1 1 1 1
    1 1 1 1 1 0 0 1 1 1 1 1 1 0 0 0 1 1 1 1 1 1 0 0 1 1 1 1 1
    1 1 1 1 1 0 0 1 1 1 1 1 1 0 0 0 1 1 1 1 1 1 0 0 1 1 1 1 1
    1 1 1 1 1 0 1 1 1 1 1 1 0 0 1 0 0 1 1 1 1 1 1 0 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 0 0 1 1 1 0 0 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
    1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
]

# %%
b = unique(collect.(eachcol(A)))
B = hcat(b...)

# %%
c = deepcopy(b)
for v in c[2:end] v .-= c[1]; v .*= -1 end
C = hcat(c...)

# %%
for i in axes(B, 1)
    for j in axes(B, 2)
        j > 1 && print(" & ")
        print(B[i,j])
    end
    println(" \\\\")
end

# %%
for i in axes(C, 1)
    for j in axes(C, 2)
        j > 1 && print(" & ")
        print(C[i,j])
    end
    println(" \\\\")
end

# %%
for i in axes(C, 1)
    print("& ($i) \\quad ")
    f = false
    for j in axes(C, 2)
        if C[i, j] == 1
            if f == false
                f = true
            else
                print("+")
            end
            print("x_{$j}")
        end
    end
    println(" = 0 \\\\")
end

# %%
